// 枚举常量 Enum Constant

const enums = {

  // 样品类型
  sampleType: {
    1: '水和废水',
    2: '噪声、振动',
    4: '空气和废气',
    8: '土壤、底质',
  },

  // 曲线参数类型
  curveType: {
    1: '普通',
    2: '紫外',
    3: '荧光',
    4: '石墨炉',
  },

  // 计量单位
  dimensionUnit: {
    1: 'μs/cm',
    2: 'mmol/L',
    3: 'm/s',
    4: 'μg/kg',
    5: 'μg/L',
    6: 'KPa',
    7: '个/mL',
    8: '稀释倍数',
    9: '个/L',
    10: '℃',
    11: 'dB(A)',
    12: 'mg/L',
    13: '万吨',
    14: '无量纲',
  },

  // 分析项目
  analysisItem: {
    1: '铵离子',
    2: 'Lmin',
    3: '五日生化需氧量',
    4: '噪声源噪声',
    5: '叶绿素a',
    6: '镁离子',
    7: '夜间Leq',
    8: '藻密度',
  },

  // 分析方法
  analysisMethod: {
    '3.3.7.3': '钼酸铵分光光度法 《水和废水监测分析方法》（第四版） 国家环境保护总局 3.3.7.3',
    'GB/T10071': '《城市区域环境振动测量方法》',
    'HJ/T67': '《大气固定污染源氟化物的测定离子选择电极法》',
    'HJ/T64.1': '《大气固定污染源镉的测定火焰原子吸收分光光度法》',
    'HJ/T63.1': '《大气固定污染源锡的测定石墨炉原子吸收分光光度法》',
    'GB/T13580.4': '《大气降水PH值的测定电极法》',
  },

  // 资格
  cert: {
    0: '非认可认证',
    1: '认可',
    2: '认证',
    3: '认证认可',
  },

  // 控件类型
  componentType: {
    1: '文本控件',
    2: '数字控件',
    3: '日期控件',
    4: '下拉框控件',
    5: '单选组控件',
    6: '多选组控件',
    7: '日期时间控件',
    8: '文本区域控件',
    9: '时间控件',
  },

  // 进度条状态
  planStatus: {
    1: 'progress-success',
    2: 'progress-warning',
    3: 'progress-danger',
  },

  // 项目类型
  projectType: {
    1: '应急监制',
    2: '上级任务',
    3: '验收监制',
    4: '环境质量',
    5: '大队送样',
    6: '样品委托',
  },

  // 使用类型
  useTye: {
    1: '采样',
    2: '分析',
    4: '现场分析',
  },

  // 仪器类型
  instrumentType: {
    1: '现场设备',
    2: '玻璃仪器',
    3: '辅助设备',
    4: '采样设备',
    5: '一般仪器',
    6: '分析设备',
    7: '应急设备',
    8: '自动设备',
  },

  // 材料审核状态
  materialStatus: {
    1: '新建',
    2: '不发料',
    3: '申请提交',
    4: '审批通过',
    5: '已发料',
  },

  // 领用日志类型
  typeData: {
    1: '高纯物质',
    2: '生物染色剂',
    3: '色谱纯试剂',
    4: '仪器设备',
    5: '特殊专用试剂',
    6: '指示剂',
    7: '生化试剂',
    8: '仪器配件',
    9: '滤膜滤纸',
    10: '高纯物质',
    11: '其他类',
    12: '优级纯',
  },
};

export default {
  install(Vue) {
    // eslint-disable-next-line
    Vue.enum = Vue.prototype.$enum = enums;
  },
};
